Documents/УДАЛИТЬ_УстановкаПроцентаВыработкиРозницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УДАЛИТЬ_УстановкаПроцентаВыработкиРозницы</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УДАЛИТЬ_УстановкаПроцентаВыработкиРозницы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыЗамерщика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыМенеджера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыМонтажников</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыМонтажников_МинимальноеЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыМонтажников_МаксимальноеЗначениеПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтЧистойПрибыли</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыМенеджераДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыЗамерщика_услуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыЗамерщика_потолки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыМенеджера_услуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыМенеджера_потолки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыМонтажников_услуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыМонтажников_услуги_МинимальноеЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыМонтажников_услуги_МаксимальноеЗначениеПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыМонтажников_потолки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыМонтажников_потолки_МинимальноеЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыМонтажников_потолки_МаксимальноеЗначениеПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыМонтажников_товары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыМонтажников_товары_МинимальноеЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыМонтажников_товары_МаксимальноеЗначениеПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыМенеджераДоговора_услуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыМенеджераДоговора_потолки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыЗамерщика_товары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыМенеджера_товары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыМенеджераДоговора_товары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделятьПоВидамТоваров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыБригадираМонтажников</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыБригадираМонтажников_товары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыБригадираМонтажников_услуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаМонтажиДляЗарплатыБригадираМонтажников_потолки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсключаемыеПозиции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УДАЛИТЬ_УстановкаПроцентаВыработкиРозницы/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр УстановкаПроцентаВыработкиРозницы
	Движения.УстановкаПроцентаВыработкиРозницы.Записывать = Истина;
	Движение = Движения.УстановкаПроцентаВыработкиРозницы.Добавить();
	Движение.Период = Дата;
	Движение.Дата = Дата;
	Если НЕ РазделятьПоВидамТоваров Тогда
		Движение.ПроцентЗаМонтажиДляЗарплатыЗамерщика = ПроцентЗаМонтажиДляЗарплатыЗамерщика;
		Движение.ПроцентЗаМонтажиДляЗарплатыМенеджера = ПроцентЗаМонтажиДляЗарплатыМенеджера;
		Движение.ПроцентЗаМонтажиДляЗарплатыМенеджераДоговора = ПроцентЗаМонтажиДляЗарплатыМенеджераДоговора;
		Движение.ПроцентЗаМонтажиДляЗарплатыМонтажников = ПроцентЗаМонтажиДляЗарплатыМонтажников;
		Движение.ПроцентЗаМонтажиДляЗарплатыБригадираМонтажников = ПроцентЗаМонтажиДляЗарплатыБригадираМонтажников;
		Движение.ПроцентЗаМонтажиДляЗарплатыМонтажников_МинимальноеЗначение = ПроцентЗаМонтажиДляЗарплатыМонтажников_МинимальноеЗначение;
		Движение.ПроцентЗаМонтажиДляЗарплатыМонтажников_МаксимальноеЗначениеПроцент = ПроцентЗаМонтажиДляЗарплатыМонтажников_МаксимальноеЗначениеПроцент;
	Иначе
		Движение.ПроцентЗаМонтажиДляЗарплатыЗамерщика_услуги = ПроцентЗаМонтажиДляЗарплатыЗамерщика_услуги;
		Движение.ПроцентЗаМонтажиДляЗарплатыЗамерщика_потолки = ПроцентЗаМонтажиДляЗарплатыЗамерщика_потолки;
		Движение.ПроцентЗаМонтажиДляЗарплатыЗамерщика_товары = ПроцентЗаМонтажиДляЗарплатыЗамерщика_товары;
		
		Движение.ПроцентЗаМонтажиДляЗарплатыМенеджера_услуги = ПроцентЗаМонтажиДляЗарплатыМенеджера_услуги;
		Движение.ПроцентЗаМонтажиДляЗарплатыМенеджера_потолки = ПроцентЗаМонтажиДляЗарплатыМенеджера_потолки;
		Движение.ПроцентЗаМонтажиДляЗарплатыМенеджера_товары = ПроцентЗаМонтажиДляЗарплатыМенеджера_товары;
		
		Движение.ПроцентЗаМонтажиДляЗарплатыМонтажников_услуги = ПроцентЗаМонтажиДляЗарплатыМонтажников_услуги;
		Движение.ПроцентЗаМонтажиДляЗарплатыМонтажников_потолки = ПроцентЗаМонтажиДляЗарплатыМонтажников_потолки;
		Движение.ПроцентЗаМонтажиДляЗарплатыМонтажников_товары = ПроцентЗаМонтажиДляЗарплатыМонтажников_товары;
		Движение.ПроцентЗаМонтажиДляЗарплатыМонтажников_услуги_МинимальноеЗначение = ПроцентЗаМонтажиДляЗарплатыМонтажников_услуги_МинимальноеЗначение;
		Движение.ПроцентЗаМонтажиДляЗарплатыМонтажников_потолки_МинимальноеЗначение = ПроцентЗаМонтажиДляЗарплатыМонтажников_потолки_МинимальноеЗначение;
		Движение.ПроцентЗаМонтажиДляЗарплатыМонтажников_товары_МинимальноеЗначение = ПроцентЗаМонтажиДляЗарплатыМонтажников_товары_МинимальноеЗначение;
		Движение.ПроцентЗаМонтажиДляЗарплатыМонтажников_услуги_МаксимальноеЗначениеПроцент = ПроцентЗаМонтажиДляЗарплатыМонтажников_услуги_МаксимальноеЗначениеПроцент;
		Движение.ПроцентЗаМонтажиДляЗарплатыМонтажников_потолки_МаксимальноеЗначениеПроцент = ПроцентЗаМонтажиДляЗарплатыМонтажников_потолки_МаксимальноеЗначениеПроцент;
		Движение.ПроцентЗаМонтажиДляЗарплатыМонтажников_товары_МаксимальноеЗначениеПроцент = ПроцентЗаМонтажиДляЗарплатыМонтажников_товары_МаксимальноеЗначениеПроцент;
		
		Движение.ПроцентЗаМонтажиДляЗарплатыМенеджераДоговора_услуги = ПроцентЗаМонтажиДляЗарплатыМенеджераДоговора_услуги;
		Движение.ПроцентЗаМонтажиДляЗарплатыМенеджераДоговора_потолки = ПроцентЗаМонтажиДляЗарплатыМенеджераДоговора_потолки;
		Движение.ПроцентЗаМонтажиДляЗарплатыМенеджераДоговора_товары = ПроцентЗаМонтажиДляЗарплатыМенеджераДоговора_товары;
		
		Движение.ПроцентЗаМонтажиДляЗарплатыБригадираМонтажников_товары = ПроцентЗаМонтажиДляЗарплатыБригадираМонтажников_товары;
		Движение.ПроцентЗаМонтажиДляЗарплатыБригадираМонтажников_услуги = ПроцентЗаМонтажиДляЗарплатыБригадираМонтажников_услуги;
		Движение.ПроцентЗаМонтажиДляЗарплатыБригадираМонтажников_потолки = ПроцентЗаМонтажиДляЗарплатыБригадираМонтажников_потолки;
	КонецЕсли;
	Если ИсключаемыеПозиции.Количество() > 0 Тогда
		Движение.ДокументСпискаИсключаемыхПозиций = Ссылка;
	КонецЕсли;
	Движение.ОтЧистойПрибыли = ОтЧистойПрибыли;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
